#check slice notation a.k.a. word[::-1]
#https://sentry.io/answers/python-slice-notation/

word = input()

#взимаме дължината на думата в брой символи и вадим едно [ len(word) - 1 ], за да получим номерацията на индексите (индексите започват от 0,1,2,3,...)
#края на цикъла е -1 т.е. итерира докато не получи стойност 0 (не стига до -1, защото се третира като отворен, невключващ интервал)
#стъпката на цикъла е -1 (третата минус-единица), което указва движение наобратно

for i in range(len(word) - 1, -1, -1):
    print(word[i],end='')